<pad>	0
<unk>	1
<eos>	2
from	3
threading	4
import	5
local	6
into	7
default	8
name	9
space	10
.	11
module	12
warnings	13
django.conf	14
[	15
django	16
conf	17
]	18
settings	19
django.core	20
core	21
signals	22
django.core.cache.backends.base	23
cache	24
backends	25
base	26
InvalidCacheBackendError	27
,	28
and	29
BaseCache	30
django.core.exceptions	31
exceptions	32
ImproperlyConfigured	33
django.utils.deprecation	34
utils	35
deprecation	36
RemovedInDjango19Warning	37
django.utils.module_loading	38
module_loading	39
import_string	40
__all__	41
is	42
an	43
list	44
containing	45
6	46
elements	47
:	48
_STR:0_	49
_STR:1_	50
_STR:2_	51
_STR:3_	52
DEFAULT_CACHE_ALIAS	53
a	54
string	55
if	56
not	57
contained	58
in	59
raise	60
exception	61
with	62
as	63
argument	64
'	65
%	66
s	67
replaced	68
converted	69
define	70
the	71
function	72
backend	73
dictionary	74
pair	75
of	76
kwargs	77
arguments	78
call	79
warnings.warn	80
warn	81
stacklevel	82
set	83
to	84
2	85
substitute	86
result	87
for	88
request_finished	89
close	90
return	91
try	92
value	93
under	94
key	95
KeyError	96
caught	97
ImportError	98
renamed	99
e	100
replace	101
respectively	102
remove	103
put	104
it	105
location	106
or	107
use	108
empty	109
doesnt	110
exists	111
params	112
copy	113
update	114
evaluate	115
derive	116
class	117
object	118
__init__	119
method	120
self	121
_caches	122
__getitem__	123
alias	124
caches	125
except	126
AttributeError	127
do	128
nothing	129
setting	130
all	131
get	132
attribute	133
otherwise	134
values	135
on	136
__getattr__	137
delete	138
__contains__	139
boolean	140
True	141
False	142
__eq__	143
other	144
equals	145
__ne__	146
equal	147
every	148
__future__	149
unicode_literals	150
time	151
DEFAULT_TIMEOUT	152
instance	153
integer	154
3	155
key_prefix	156
version	157
convert	158
strings	159
concatenate	160
them	161
character	162
delimiter	163
key_func	164
None	165
type	166
callable	167
initialization	168
params.get	169
300	170
previous	171
timeout	172
ValueError	173
TypeError	174
occurred	175
options	176
self._max_entries	177
_max_entries	178
self._cull_frequency	179
_cull_frequency	180
wit	181
1	182
get_backend_timeout	183
0	184
-1	185
sum	186
time.time	187
make_key	188
add	189
5	190
defaulting	191
NotImplementedError	192
4	193
keys	194
d	195
k	196
self.get	197
val	198
has_key	199
incr	200
delta	201
where	202
substituted	203
together	204
new_value	205
negative	206
private	207
data	208
items	209
clear	210
validate_key	211
length	212
greater	213
than	214
char	215
smaller	216
incremented	217
by	218
pairs	219
base64	220
datetime	221
django.utils.six.moves	222
six	223
moves	224
pickle	225
namespace	226
django.db	227
db	228
connections	229
transaction	230
router	231
DatabaseError	232
django.utils	233
timezone	234
django.utils.encoding	235
encoding	236
force_bytes	237
table	238
db_table	239
app_label	240
object_name	241
proxy	242
BaseDatabaseCache	243
self._table	244
_table	245
_meta	246
initialized	247
self.cache_model_class	248
cache_model_class	249
self.make_key	250
self.validate_key	251
ops.quote_name	252
ops	253
quote_name	254
cursor	255
preform	256
following	257
named	258
cursor.execute	259
execute	260
row	261
now	262
third	263
element	264
expires	265
features	266
field	267
true	268
lesser	269
router.db_for_write	270
db_for_write	271
second	272
loads	273
self.get_backend_timeout	274
one	275
record	276
database	277
points	278
at	279
first	280
num	281
exp	282
microsecond	283
_cull	284
pickle.dumps	285
dumps	286
pickle.HIGHEST_PROTOCOL	287
HIGHEST_PROTOCOL	288
pickled	289
b64encoded	290
six.PY3	291
PY3	292
decode	293
transaction.atomic	294
atomic	295
using	296
perform	297
entry	298
that	299
current_expires	300
mode	301
settings.USE_TZ	302
USE_TZ	303
next	304
tzinfo	305
divide	306
floor	307
host	308
args	309
errno	310
glob	311
hashlib	312
io	313
os	314
random	315
tempfile	316
zlib	317
files	318
move	319
file_move_safe	320
dir	321
absolute	322
directory	323
path	324
self._dir	325
_dir	326
fname	327
file	328
io.open	329
open	330
f	331
false	332
read	333
decompress	334
IOError	335
e.errno	336
fd	337
write	338
compress	339
finally	340
self._delete	341
_delete	342
start	343
OSError	344
does	345
filelist	346
sample	347
hexadecimal	348
errno.EEXIST	349
EEXIST	350
join	351
md5	352
hash	353
(	354
)	355
root	356
out	357
load	358
stream	359
f.name	360
called	361
appended	362
results	363
setdefault	364
_expire_info	365
_lock	366
self._lock.writer	367
writer	368
self._cache	369
_cache	370
evaluates	371
i	372
enumerated	373
append	374
force_str	375
django.utils.functional	376
functional	377
cached_property	378
tuple	379
BaseMemcachedCache	380
server	381
six.string_types	382
string_types	383
split	384
self._servers	385
_servers	386
property	387
decorator	388
has	389
increment	390
ret	391
_	392
zip	393
assign	394
m	395
v	396
l	397
lambda	398
x	399
through	400
django.utils.http	401
http	402
urlquote	403
var	404
separated	405
hexdigest	406
CheckMessage	407
Warning	408
Error	409
DEBUG	410
INFO	411
WARNING	412
ERROR	413
CRITICAL	414
register	415
run_checks	416
tag_exists	417
Tags	418
checks	419
compatibility	420
_STR:4_	421
_STR:5_	422
django.apps	423
apps	424
errors	425
extend	426
app_config	427
weight	428
settings.is_overridden	429
is_overridden	430
hint	431
new	432
this	433
was	434
generated	435
are	436
``	437
obj	438
id	439
models	440
model	441
get_models	442
only	443
app_configs	444
BooleanField	445
python_2_unicode_compatible	446
10	447
20	448
level	449
msg	450
error	451
message	452
self.msg	453
self.obj	454
self.id	455
attr	456
have	457
same	458
__str__	459
self.object	460
model._meta.app_label	461
app	462
model._meta.object_name	463
__repr__	464
unpacked	465
itertools	466
chain	467
types	468
check	469
store	470
receiver	471
description	472
__name__	473
__class__	474
signal	475
lazy	476
sender	477
which	478
''	479
joined	480
__module__	481
registered_checks	482
tags	483
inner	484
iterable	485
tag	486
registry	487
middleware	488
smart_text	489
request	490
token	491
six.text_type	492
text_type	493
debug	494
context_extras	495
settings.DEBUG	496
META	497
connection	498
translation	499
get_language	500
get_language_bidi	501
static	502
media	503
functools	504
operator	505
force_text	506
Exception	507
SuspiciousOperation	508
ViewDoesNotExist	509
NON_FIELD_ERRORS	510
ValidationError	511
code	512
error_dict	513
error_list	514
message.message	515
dict	516
messages	517
created	518
self.message	519
self.code	520
getter	521
__iter__	522
yield	523
division	524
printable	525
representation	526
File	527
BytesIO	528
StringIO	529
FileProxyMixin	530
bring	531
power	532
multiply	533
64	534
self.file	535
self.name	536
self.__class__.__name__	537
__bool__	538
__nonzero__	539
__len__	540
size	541
position	542
pointer	543
pos	544
end	545
setter	546
closed	547
chunks	548
chunk_size	549
beginning	550
endless	551
loop	552
break	553
smallest	554
enclosing	555
buffer_	556
chunk	557
line	558
last	559
newline	560
__enter__	561
__exit__	562
exc_type	563
exc_value	564
tb	565
handler	566
content	567
seek	568
django.core.files	569
width	570
p	571
parser	572
calling	573
Parser	574
bytes	575
handle	576
while	577
feed	578
raised	579
e.args	580
starts	581
fed	582
double	583
being	584
_fd	585
fileno	586
os.name	587
DWORD	588
LOCK_EX	589
tuples	590
contains	591
LockFileEx	592
lock	593
flags	594
unlock	595
fcntl	596
locks	597
shutil	598
stat	599
src	600
dst	601
st	602
old_file_name	603
new_file_name	604
integers	605
descriptor	606
binary	607
expression	608
operands	609
13	610
django.utils.six.moves.urllib.parse	611
urllib	612
parse	613
urljoin	614
django.utils.text	615
text	616
get_valid_filename	617
django.utils._os	618
_os	619
safe_join	620
deconstruct	621
deconstructible	622
save	623
file_name	624
os.path.splitext	625
splitext	626
file_ext	627
count	628
valid	629
url	630
base_url	631
file_permissions_mode	632
directory_permissions_mode	633
ends	634
self.path	635
full_path	636
os.path.dirname	637
dirname	638
umask	639
number	640
_file	641
directories	642
lists	643
os.path.normpath	644
normpath	645
_setup	646
self._wrapped	647
_wrapped	648
suffix	649
prefix	650
respective	651
unlink	652
be	653
exc	654
NamedTemporaryFile	655
7	656
content_type	657
charset	658
content_type_extra	659
self.content_type	660
self.charset	661
self.content_type_extra	662
os.path.basename	663
basename	664
ext	665
subtract	666
take	667
up	668
index	669
resulting	670
InMemoryUploadedFile	671
8	672
field_name	673
generator	674
classmethod	675
cls	676
connection_reset	677
self.file_name	678
content_length	679
boundary	680
new_file	681
raw_data	682
file_size	683
self.activated	684
activated	685
form	686
returns	687
flush	688
isatty	689
newlines	690
readline	691
tell	692
truncate	693
iterator	694
logging	695
sys	696
urlresolvers	697
logging.getLogger	698
getLogger	699
logger	700
style	701
fields	702
_request_middleware	703
mw_instance	704
skip	705
iteration	706
insert	707
self._request_middleware	708
view	709
exist	710
resolver	711
status_code	712
callback	713
response	714
send	715
exec_info	716
urlconf	717
RegexURLResolver	718
raw	719
literal	720
middleware_method	721
execution	722
resolve	723
path_info	724
resolver_match	725
view_name	726
render	727
Http404	728
extra	729
two	730
warning	731
400	732
evaluated	733
sys.exc_info	734
exc_info	735
status	736
any	737
member	738
_closable_objects	739
urlconf_module	740
reraise	741
func	742
cgi	743
codecs	744
handlers	745
datastructures	746
def	747
limit	748
self.stream	749
remaining	750
self.buffer	751
buffer	752
zero	753
decrement	754
subtracted	755
environ	756
script_name	757
self.environ	758
strip	759
occurrence	760
self.META	761
uppercase	762
parse_header	763
lookup	764
LookupError	765
self.encoding	766
self._stream	767
_stream	768
self._read_started	769
_read_started	770
MergeDict	771
get_bytes_from_wsgi	772
QueryDict	773
self._encoding	774
_encoding	775
self._post	776
_post	777
post	778
COOKIES	779
self._files	780
_files	781
__call__	782
re	783
self.__class__	784
UnicodeDecodeError	785
reason_phrase	786
item	787
c	788
cookies	789
output	790
format	791
script_url	792
but	793
six.PY2	794
PY2	795
value.encode	796
encode	797
mail	798
DNS_NAME	799
EmailMessage	800
EmailMultiAlternatives	801
BadHeaderError	802
forbid_multi_line_headers	803
_STR:6_	804
_STR:7_	805
_STR:8_	806
_STR:9_	807
get_connection	808
fail_silently	809
kwds	810
klass	811
subject	812
from_email	813
username	814
password	815
html_message	816
change	817
send_messages	818
BaseEmailBackend	819
self.fail_silently	820
traceback	821
email_messages	822
EmailBackend	823
pop	824
sys.stdout	825
stdout	826
RLock	827
as_bytes	828
characters	829
msg_count	830
create	831
self.file_path	832
file_path	833
os.path.abspath	834
abspath	835
strftime	836
timestamp	837
smtplib	838
sanitize_address	839
port	840
use_tls	841
use_ssl	842
self.port	843
self.username	844
self.connection	845
initial	846
email_message	847
recipients	848
addr	849
email	850
MIMEText	851
header	852
Header	853
formatdate	854
utf8_charset	855
idstring	856
settings.DEFAULT_CHARSET	857
DEFAULT_CHARSET	858
UnicodeEncodeError	859
lower	860
case	861
nm	862
domain	863
instantiate	864
as_string	865
unixfrom	866
fp	867
g	868
getvalue	869
__setitem__	870
subtype	871
sys.version_info	872
version_info	873
body	874
cc	875
self.cc	876
bcc	877
self.subject	878
self.body	879
attachments	880
self.attachments	881
headers	882
extra_headers	883
attach	884
filename	885
mimetype	886
msg.attach	887
attachment	888
11	889
9	890
alternatives	891
self.alternatives	892
socket	893
collections	894
importlib	895
import_module	896
django.core.management.base	897
management	898
BaseCommand	899
CommandError	900
CommandParser	901
django.core.management.color	902
color	903
color_style	904
lru_cache	905
without	906
app_name	907
Command	908
lru_cache.lru_cache	909
maxsize	910
get_commands	911
commands	912
reversed	913
apps.get_app_configs	914
get_app_configs	915
app_config.path	916
entries	917
call_command	918
command	919
create_parser	920
use_argparse	921
parse_args	922
defaults	923
mapping	924
__dict__	925
argv	926
self.argv	927
sys.argv	928
prog_name	929
sorted	930
usage	931
six.iteritems	932
iteritems	933
arugment	934
NOTICE	935
subcommand	936
sys.stderr.write	937
stderr	938
sys.exit	939
exit	940
os.environ	941
whitespace	942
cwords	943
decremented	944
IndexError	945
filter	946
sort	947
spaces	948
print	949
standard	950
servers	951
app_config.label	952
label	953
s_opt	954
nargs	955
slice	956
opt	957
option	958
parser.add_argument	959
add_argument	960
wiht	961
configure	962
get_version	963
no_style	964
RemovedInDjango20Warning	965
cmd	966
statement	967
arg	968
self.error	969
missing_args_message	970
OutputWrapper	971
style_func	972
ending	973
help	974
can_import_settings	975
output_transaction	976
leave_locale_alone	977
self.style	978
both	979
requires_system_checks	980
they	981
self.args	982
parser.add_option	983
add_option	984
action	985
dest	986
choices	987
joining	988
int	989
add_arguments	990
sys.stderr	991
self.stdout	992
self.stderr	993
activate	994
DEFAULT_DB_ALIAS	995
display_num_errors	996
t	997
all_issues	998
visible_issue_count	999
e.level	1000
formatted	1001
AppCommand	1002
metavar	1003
app_labels	1004
apps.get_app_config	1005
get_app_config	1006
handle_app_config	1007
2.	1008
app_config.models_module	1009
models_module	1010
self.label	1011
labels	1012
termcolors	1013
sys.platform	1014
platform	1015
input	1016
dummy	1017
role	1018
PALETTES	1019
NOCOLOR_PALETTE	1020
sets	1021
identity	1022
find_command	1023
popen_wrapper	1024
upath	1025
fn	1026
program	1027
locale	1028
exclude	1029
self.program	1030
basedirs	1031
settings.LOCALE_PATHS	1032
LOCALE_PATHS	1033
basedir	1034
all_locales	1035
locale_dirs	1036
names	1037
returned	1038
locales	1039
dirs	1040
locations	1041
dirpath	1042
dirnames	1043
filenames	1044
starting	1045
self.verbosity	1046
verbosity	1047
self.stdout.write	1048
occurrences	1049
base_path	1050
self.stderr.write	1051
tablename	1052
connection.introspection.table_names	1053
introspection	1054
table_names	1055
CharField	1056
max_length	1057
unique	1058
qn	1059
field_output	1060
whitespaces	1061
its	1062
connection.cursor	1063
OrderedDict	1064
serializers	1065
indent	1066
use_natural_keys	1067
use_natural_foreign_keys	1068
use_natural_primary_keys	1069
pks	1070
primary_keys	1071
excluded_apps	1072
apps.get_model	1073
get_model	1074
app_list	1075
SerializerDoesNotExist	1076
objects	1077
_default_manager	1078
pk	1079
queryset	1080
serialize	1081
model_dependencies	1082
model_list	1083
natural_key	1084
deps	1085
field.rel	1086
rel	1087
field.rel.to	1088
rel_model	1089
many_to_many	1090
auto_created	1091
reverse	1092
found	1093
candidate	1094
separator	1095
django.core.management.sql	1096
sql	1097
sql_flush	1098
emit_post_migrate_signal	1099
interactive	1100
reset_sequences	1101
allow_cascade	1102
app_config.name	1103
o	1104
confirm	1105
query	1106
e.	1107
six.reraise	1108
router.get_migratable_models	1109
get_migratable_models	1110
include_auto_created	1111
table_name	1112
re.sub	1113
sub	1114
title	1115
s.	1116
known_models	1117
relations	1118
indexes	1119
used_column_names	1120
comment_notes	1121
extra_params	1122
column_name	1123
is_relation	1124
i-th	1125
rel_to	1126
field_type	1127
field_params	1128
field_notes	1129
field_desc	1130
col_name	1131
lowercase	1132
new_name	1133
find	1134
digit	1135
fourth	1136
zipfile	1137
fixture_labels	1138
ignore	1139
self.using	1140
self.fixture_count	1141
fixture_count	1142
self.loaded_object_count	1143
loaded_object_count	1144
compression_formats	1145
fixture_label	1146
model._meta.db_table	1147
grater	1148
fixture_dir	1149
fixture_name	1150
ser_fmt	1151
cmp_fmt	1152
humanize	1153
error_msg	1154
fixture_dirs	1155
sep	1156
targets	1157
fixture_files_in_dir	1158
app_dir	1159
parts	1160
namelist	1161
handle_extensions	1162
total_ordering	1163
get_text_list	1164
re.compile	1165
compile	1166
bitwise	1167
OR	1168
performed	1169
STATUS_OK	1170
locale_dir	1171
self.dirpath	1172
process	1173
django.utils.translation	1174
templatize	1175
extensions	1176
is_templatized	1177
orig_file	1178
settings.FILE_CHARSET	1179
FILE_CHARSET	1180
src_data	1181
thefile	1182
work_file	1183
xgettext_options	1184
_STR:10_	1185
msgs	1186
potfile	1187
old	1188
self.domain	1189
ignore_patterns	1190
exts	1191
settings.USE_I18N	1192
USE_I18N	1193
self.locale_paths	1194
locale_paths	1195
self.default_locale_path	1196
default_locale_path	1197
map	1198
difference	1199
between	1200
potfiles	1201
pattern	1202
make	1203
pofile	1204
__file__	1205
search	1206
m.group	1207
group	1208
lines	1209
migrations	1210
Migration	1211
django.db.migrations.loader	1212
loader	1213
MigrationLoader	1214
autodetector	1215
MigrationAutodetector	1216
state	1217
MigrationWriter	1218
self.interactive	1219
dry_run	1220
self.merge	1221
merge	1222
conflicts	1223
changes	1224
graph	1225
self.style.MIGRATE_HEADING	1226
MIGRATE_HEADING	1227
migration	1228
self.style.MIGRATE_LABEL	1229
MIGRATE_LABEL	1230
operation	1231
operations	1232
writer.path	1233
fh	1234
merge_migrations	1235
migration_name	1236
migration.name	1237
subclass	1238
executor	1239
MigrationExecutor	1240
AmbiguityError	1241
module_has_submodule	1242
package	1243
migrated_apps	1244
vale	1245
plan	1246
n	1247
created_models	1248
create_models	1249
self.style.NOTICE	1250
fake	1251
connection.alias	1252
tables	1253
pending_references	1254
model._meta	1255
opts	1256
converter	1257
manifest	1258
unpack	1259
creation	1260
refto	1261
connection.creation.sql_for_pending_references	1262
sql_for_pending_references	1263
statements	1264
app_names	1265
node	1266
plan_node	1267
replaces	1268
filed	1269
nodes	1270
settings.LANGUAGE_CODE	1271
LANGUAGE_CODE	1272
run	1273
get_internal_wsgi_application	1274
?	1275
P	1276
<	1277
>	1278
{	1279
}	1280
ipv6	1281
self.use_ipv6	1282
use_ipv6	1283
self.addr	1284
match	1285
groups	1286
shutdown_message	1287
validate	1288
te	1289
shell	1290
pythonrc	1291
source	1292
variables	1293
NameError	1294
extract	1295
parent	1296
target	1297
check_for_migrations	1298
answer	1299
lengths	1300
TemplateCommand	1301
project_name	1302
chars	1303
test_runner	1304
app_models	1305
final_output	1306
r	1307
functions	1308
surrounding	1309
template	1310
Template	1311
Context	1312
archive	1313
I	1314
app_or_project	1315
paths_to_remove	1316
current	1317
top_dir	1318
ignored	1319
context	1320
autoescape	1321
template_dir	1322
new_path	1323
expanded_template	1324
absolute_path	1325
display_url	1326
tempdir	1327
the_path	1328
guessed_filename	1329
scheme	1330
calculate	1331
subprocess	1332
PIPE	1333
DEFAULT_LOCALE_ENCODING	1334
strings_only	1335
ext_list	1336
pathext	1337
object_list	1338
per_page	1339
orphans	1340
allow_empty_first_page	1341
self.object_list	1342
self._num_pages	1343
_num_pages	1344
self._count	1345
_count	1346
num_pages	1347
top	1348
floating	1349
point	1350
paginator	1351
self.number	1352
six.integer_types	1353
integer_types	1354
end_index	1355
_serializers	1356
internal_use_only	1357
_load_serializers	1358
Deserializer	1359
Serializer	1360
stream_or_string	1361
global	1362
variable	1363
DeserializationError	1364
self.options	1365
self.selected_fields	1366
selected_fields	1367
self.use_natural_foreign_keys	1368
start_serialization	1369
self.first	1370
field.attname	1371
attname	1372
handle_field	1373
end_object	1374
end_serialization	1375
six.Iterator	1376
Iterator	1377
__next__	1378
m2m_data	1379
save_m2m	1380
Model	1381
db_manager	1382
get_by_natural_key	1383
decimal	1384
json	1385
PythonSerializer	1386
django.utils.timezone	1387
is_aware	1388
self._current	1389
_current	1390
self.json_kwargs	1391
json_kwargs	1392
DjangoJSONEncoder	1393
datetime.datetime	1394
datetime.date	1395
date	1396
datetime.time	1397
12	1398
Decimal	1399
is_protected_type	1400
_get_pk_val	1401
field.name	1402
related	1403
base.DeserializationError	1404
to_python	1405
field_value	1406
str	1407
get_field	1408
m2m_convert	1409
field.rel.field_name	1410
field.to_python	1411
model_identifier	1412
yaml	1413
Loader	1414
SimplerXMLGenerator	1415
xml	1416
self.xml.startElement	1417
startElement	1418
self.indent	1419
self.xml.endElement	1420
endElement	1421
attrs	1422
obj_pk	1423
addQuickElement	1424
self.db	1425
StopIteration	1426
getAttribute	1427
field_node	1428
getElementsByTagName	1429
getInnerText	1430
child	1431
sysid	1432
pubid	1433
notation_name	1434
reset	1435
self.sysid	1436
self.pubid	1437
tpl	1438
self.value	1439
WSGIServer	1440
classes	1441
formated	1442
fastcgi_help	1443
wsgi_opts	1444
daemonize	1445
daemon_kwargs	1446
our_home_dir	1447
constant_time_compare	1448
BadSignature	1449
salt	1450
digest	1451
base64d	1452
TimestampSigner	1453
sign	1454
unsign	1455
max_age	1456
self.sep	1457
signature	1458
signed_value	1459
django.utils.datastructures	1460
MultiValueDict	1461
iri_to_uri	1462
normalize	1463
url_name	1464
namespaces	1465
self.func	1466
self.kwargs	1467
self.app_name	1468
self.namespaces	1469
func.__name__	1470
Resolver404	1471
NoReverseMatch	1472
get_callable	1473
lookup_view	1474
can_fail	1475
mod_name	1476
mod	1477
view_func	1478
ns_pattern	1479
dot	1480
LocaleRegexProvider	1481
regex	1482
_regex	1483
self._regex_dict	1484
_regex_dict	1485
language_code	1486
self.regex	1487
re.UNICODE	1488
UNICODE	1489
default_args	1490
self._callback	1491
_callback	1492
_callback_str	1493
add_prefix	1494
match.groupdict	1495
groupdict	1496
urlconf_name	1497
default_kwargs	1498
self.urlconf_name	1499
self.urlconf_module	1500
_callback_strs	1501
_populate	1502
lookups	1503
p_pattern	1504
matches	1505
getlist	1506
appendlist	1507
bits	1508
tried	1509
sub_match	1510
patterns	1511
included	1512
covert	1513
candidate_subs	1514
viewname	1515
current_app	1516
ns	1517
cache_clear	1518
ugettext_lazy	1519
ungettext_lazy	1520
urlsplit	1521
urlunsplit	1522
RegexValidator	1523
inverse_match	1524
URLValidator	1525
re.IGNORECASE	1526
IGNORECASE	1527
schemes	1528
netloc	1529
fragment	1530
UnicodeError	1531
domain_whitelist	1532
domain_part	1533
validate_ipv4_address	1534
protocol	1535
unpack_ipv4	1536
BaseValidator	1537
compare	1538
b	1539
clean	1540
limit_value	1541
forms	1542
everything	1543
django.forms.widgets	1544
widgets	1545
Widget	1546
Select	1547
datetime_safe	1548
MONTHS	1549
django.utils.safestring	1550
safestring	1551
mark_safe	1552
formats	1553
get_format	1554
fmt	1555
escaped	1556
'\\	1557
none_value	1558
years	1559
months	1560
empty_label	1561
self.attrs	1562
year	1563
month	1564
day	1565
year_val	1566
month_val	1567
day_val	1568
settings.USE_L10N	1569
USE_L10N	1570
strptime	1571
html	1572
id_for_label	1573
id_	1574
y	1575
is_required	1576
self.build_attrs	1577
build_attrs	1578
validators	1579
django.forms.utils	1580
from_current_timezone	1581
to_current_timezone	1582
TextInput	1583
NumberInput	1584
HiddenInput	1585
MultipleHiddenInput	1586
ClearableFileInput	1587
CheckboxInput	1588
NullBooleanSelect	1589
SelectMultiple	1590
SplitDateTimeWidget	1591
FILE_INPUT_CONTRADICTION	1592
_STR:11_	1593
_STR:12_	1594
_STR:13_	1595
_STR:14_	1596
_STR:15_	1597
_STR:16_	1598
_STR:17_	1599
_STR:18_	1600
Field	1601
widget	1602
hidden_widget	1603
default_validators	1604
default_error_messages	1605
empty_values	1606
creation_counter	1607
required	1608
help_text	1609
error_messages	1610
show_hidden_initial	1611
localize	1612
label_suffix	1613
self.required	1614
self.initial	1615
self.localize	1616
is_localized	1617
widget_attrs	1618
extra_attrs	1619
widget.attrs	1620
order	1621
self.error_messages	1622
self.validators	1623
prepare_value	1624
self.empty_values	1625
self.to_python	1626
limit_choices_to	1627
_has_changed	1628
initial_value	1629
_coerce	1630
data_value	1631
__deepcopy__	1632
memo	1633
copy.deepcopy	1634
deepcopy	1635
min_length	1636
self.max_length	1637
IntegerField	1638
max_value	1639
min_value	1640
max_digits	1641
decimal_places	1642
self.max_digits	1643
self.decimal_places	1644
as_tuple	1645
exponent	1646
decimals	1647
digits	1648
BaseTemporalField	1649
input_formats	1650
error_message	1651
FileField	1652
url_fields	1653
ChoiceField	1654
self.choices	1655
_choices	1656
self.coerce	1657
coerce	1658
self.empty_value	1659
empty_value	1660
choice	1661
self.fields	1662
data_list	1663
has_changed	1664
sequence	1665
allow_files	1666
allow_folders	1667
self.match	1668
regular	1669
sides	1670
flatatt	1671
ErrorList	1672
Media	1673
MediaDefiningClass	1674
django.utils.html	1675
conditional_escape	1676
format_html	1677
ugettext	1678
bases	1679
base_fields	1680
declared_fields	1681
DeclarativeFieldsMetaclass	1682
__new__	1683
mcs	1684
new_class	1685
auto_id	1686
error_class	1687
empty_permitted	1688
self.is_bound	1689
is_bound	1690
self.data	1691
self.files	1692
self.auto_id	1693
self.prefix	1694
self.error_class	1695
self._errors	1696
_errors	1697
self._changed_data	1698
_changed_data	1699
self.base_fields	1700
as_table	1701
full_clean	1702
is_valid	1703
self.errors	1704
self.add_prefix	1705
normal_row	1706
error_row	1707
row_ender	1708
help_text_html	1709
errors_on_separate_row	1710
hidden_fields	1711
html_class_attr	1712
bf	1713
bf_errors	1714
is_hidden	1715
css_classes	1716
html_name	1717
as_ul	1718
value_from_datadict	1719
self.cleaned_data	1720
cleaned_data	1721
needs_multipart_form	1722
self.form	1723
self.html_name	1724
self.as_widget	1725
as_widget	1726
idx	1727
as_text	1728
contents	1729
extra_classes	1730
words	1731
ungettext	1732
TOTAL_FORM_COUNT	1733
self._non_form_errors	1734
_non_form_errors	1735
self.forms	1736
management_form	1737
self.total_form_count	1738
total_form_count	1739
self.initial_form_count	1740
initial_form_count	1741
self.min_num	1742
min_num	1743
self.max_num	1744
max_num	1745
initial_forms	1746
total_forms	1747
_construct_form	1748
add_fields	1749
sublist	1750
form.cleaned_data	1751
deleted_forms	1752
self.can_delete	1753
can_delete	1754
form.has_changed	1755
_should_delete_form	1756
can_order	1757
validate_max	1758
validate_min	1759
form.fields	1760
sting	1761
formset	1762
capfirst	1763
opts.fields	1764
fail_message	1765
commit	1766
qs	1767
localized_fields	1768
help_texts	1769
formfield_callback	1770
formfield	1771
self.widgets	1772
ModelForm	1773
self._meta	1774
self.instance	1775
validate_unique	1776
Meta	1777
class_name	1778
BaseModelFormSet	1779
self.queryset	1780
get_queryset	1781
pk_field	1782
unique_check	1783
seen_data	1784
row_data	1785
date_check	1786
duplicate	1787
ForeignKey	1788
_pk_field	1789
pk_value	1790
meta	1791
FormSet	1792
BaseInlineFormSet	1793
save_as_new	1794
fk	1795
self.fk.name	1796
form._meta.fields	1797
parent_model	1798
fk_name	1799
fks_to_parent	1800
parent_instance	1801
self.parent_instance	1802
self.to_field	1803
to_field	1804
cache_choices	1805
to_field_name	1806
ModelMultipleChoiceField	1807
format_html_join	1808
escape	1809
escape_html	1810
self.items	1811
is_naive	1812
get_current_timezone	1813
current_timezone	1814
MEDIA_TYPES	1815
_css	1816
medium	1817
paths	1818
__add__	1819
definition	1820
self.input_type	1821
input_type	1822
final_attrs	1823
substitutions	1824
DateTimeBaseInput	1825
self.format	1826
check_test	1827
selected_choices	1828
option_value	1829
option_label	1830
choice_value	1831
choice_label	1832
self.tag	1833
choice_input_class	1834
w	1835
renderer	1836
date_format	1837
time_format	1838
cookie	1839
SimpleCookie	1840
UnreadablePostError	1841
HttpResponse	1842
http_cookies	1843
encoded	1844
unicode	1845
quote	1846
rawdata	1847
binascii	1848
unescape_entities	1849
MultiPartParserError	1850
upload_handlers	1851
self._boundary	1852
_boundary	1853
self._input_data	1854
_input_data	1855
31	1856
_upload_handlers	1857
self._upload_handlers	1858
mutable	1859
old_field_name	1860
counters	1861
meta_data	1862
field_stream	1863
transfer_encoding	1864
exhaust	1865
retval	1866
self._leftover	1867
_leftover	1868
self._unget_history	1869
_unget_history	1870
unget	1871
self._done	1872
_done	1873
rollback	1874
stream.unget	1875
TYPE	1876
plist	1877
pformat	1878
signing	1879
urlencode	1880
parser.parse	1881
buf	1882
query_string	1883
_assert_mutable	1884
self._assert_mutable	1885
bytes_to_text	1886
__delitem__	1887
__copy__	1888
iterlists	1889
setlist	1890
list_	1891
elt	1892
setlistdefault	1893
default_list	1894
safe	1895
right	1896
urlparse	1897
100	1898
200	1899
self._headers	1900
_headers	1901
self.cookies	1902
serialize_headers	1903
__getstate__	1904
has_header	1905
utc	1906
timedelta	1907
seconds	1908
days	1909
make_bytes	1910
streaming	1911
self.content	1912
self._container	1913
_container	1914
streaming_content	1915
parsed	1916
django.template.base	1917
BLOCK_TAG_END	1918
BLOCK_TAG_START	1919
COMMENT_TAG_END	1920
COMMENT_TAG_START	1921
TOKEN_BLOCK	1922
TOKEN_COMMENT	1923
TOKEN_TEXT	1924
TOKEN_VAR	1925
TRANSLATOR_COMMENT_MARK	1926
VARIABLE_ATTRIBUTE_SEPARATOR	1927
VARIABLE_TAG_END	1928
VARIABLE_TAG_START	1929
tag_re	1930
InvalidTemplateLibrary	1931
TemplateDoesNotExist	1932
TemplateSyntaxError	1933
VariableDoesNotExist	1934
Lexer	1935
Node	1936
NodeList	1937
RequestContext	1938
Origin	1939
TextNode	1940
Token	1941
Variable	1942
VariableNode	1943
unescape_string_literal	1944
Library	1945
add_to_builtins	1946
builtins	1947
get_library	1948
getargspec	1949
BaseContext	1950
pgettext_lazy	1951
SafeData	1952
EscapeData	1953
mark_for_escaping	1954
template_localtime	1955
re.escape	1956
invalid_var_format_string	1957
reload	1958
template_string	1959
origin	1960
settings.TEMPLATE_DEBUG	1961
TEMPLATE_DEBUG	1962
self.nodelist	1963
nodelist	1964
self.nodelist.render	1965
render_context	1966
push	1967
context.render_context	1968
DebugLexer	1969
DebugParser	1970
lexer	1971
token_type	1972
lineno	1973
split_contents	1974
bit	1975
self.template_string	1976
self.verbatim	1977
verbatim	1978
in_tag	1979
create_token	1980
token_string	1981
block_content	1982
tokens	1983
self.tokens	1984
self.tags	1985
self.filters	1986
filters	1987
lib	1988
parse_until	1989
self.next_token	1990
next_token	1991
extend_nodelist	1992
token.contents	1993
compile_filter	1994
filter_expression	1995
compile_func	1996
delete_first_token	1997
lib.filters	1998
filter_name	1999
self.pointer	2000
self.backout	2001
backout	2002
tagname	2003
tab	2004
res	2005
constant	2006
constant_arg	2007
var_obj	2008
upto	2009
match.group	2010
filter_func	2011
self.var	2012
settings.TEMPLATE_STRING_IF_INVALID	2013
TEMPLATE_STRING_IF_INVALID	2014
arg_vals	2015
use_tz	2016
context.autoescape	2017
new_obj	2018
varargs	2019
varkw	2020
self.literal	2021
translate	2022
message_context	2023
obtain	2024
child_nodelists	2025
get_nodes_by_type	2026
nodetype	2027
render_value_in_context	2028
use_l10n	2029
kwarg_re	2030
token_kwargs	2031
parser.compile_filter	2032
takes_context	2033
unhandled_params	2034
param	2035
token.split_contents	2036
resolved_args	2037
resolved_kwargs	2038
compile_function	2039
dec	2040
function_name	2041
__doc__	2042
target_var	2043
django.template.loader	2044
get_template	2045
select_template	2046
new_context	2047
csrf_token	2048
taglib_module	2049
templatetags_modules	2050
library_name	2051
_standard_context_processors	2052
dicts	2053
dict_	2054
self.dicts	2055
other_dict	2056
processors	2057
token.source	2058
e.django_template_source	2059
django_template_source	2060
InvalidOperation	2061
wraps	2062
escapejs	2063
urlize	2064
linebreaks	2065
strip_tags	2066
avoid_wrapping	2067
remove_tags	2068
Truncator	2069
wrap	2070
phone2numeric	2071
timesince	2072
normalize_newlines	2073
slugify	2074
stringfilter	2075
_dec	2076
register.filter	2077
is_safe	2078
input_val	2079
OverflowError	2080
number_format	2081
needs_autoescape	2082
second_item	2083
old_style_list	2084
sublist_item	2085
i+1	2086
-th	2087
no	2088
filesize_number_format	2089
left	2090
variable_name	2091
silent	2092
sys.modules	2093
modules	2094
filter_expr	2095
context.push	2096
loopvars	2097
is_reversed	2098
nodelist_loop	2099
nodelist_empty	2100
self.loopvars	2101
self.nodelist_loop	2102
len_values	2103
loop_dict	2104
nodelist_true	2105
nodelist_false	2106
state_frame	2107
compare_to	2108
negate	2109
val2	2110
val1	2111
conditions_nodelists	2112
condition	2113
eval	2114
var_name	2115
filepath	2116
format_string	2117
strip_spaces_between_tags	2118
asvar	2119
self.asvar	2120
max_width	2121
extra_context	2122
self.extra_context	2123
register.tag	2124
parser.delete_first_token	2125
comment	2126
rest	2127
used	2128
parser.next_token	2129
taglib	2130
temp_lib	2131
remaining_bits	2132
template_source_loaders	2133
BaseLoader	2134
is_usable	2135
template_name	2136
template_dirs	2137
load_template_source	2138
display_name	2139
make_origin	2140
get_template_from_string	2141
loaders	2142
context_instance	2143
BLOCK_CONTEXT_KEY	2144
self.blocks	2145
blocks	2146
block	2147
block_context	2148
parent_name	2149
isolated_context	2150
block_name	2151
fs_encoding	2152
app_template_dirs	2153
self.find_template_cache	2154
find_template_cache	2155
cache_key	2156
resource_string	2157
SimpleTemplateResponse	2158
self._is_rendered	2159
_is_rendered	2160
obj_dict	2161
fset	2162
TokenBase	2163
nud	2164
bp	2165
lbp	2166
inflix	2167
x.eval	2168
y.eval	2169
EndToken	2170
self.current_token	2171
current_token	2172
normcase	2173
final_path	2174
fist	2175
link	2176
to_path	2177
_archive	2178
leading	2179
outfile	2180
dictioanry	2181
termios	2182
pyinotify	2183
_mtimes	2184
_error_files	2185
_cached_filenames	2186
new_filenames	2187
gettext	2188
trans_real	2189
_translations	2190
_default	2191
_active	2192
EventHandler	2193
notifier	2194
wrapper	2195
exit_code	2196
main_func	2197
self.digits	2198
neg	2199
reminder	2200
BaseConverter	2201
cc_delim_re	2202
response.has_header	2203
el	2204
cache_timeout	2205
vary_headers	2206
headerlist	2207
hmac	2208
secret	2209
range	2210
iterations	2211
dklen	2212
hlen	2213
floored	2214
u	2215
j	2216
buffering	2217
out_log	2218
_iteritems	2219
_iterkeys	2220
_itervalues	2221
itervalues	2222
SortedDict	2223
keyOrder	2224
self.keyOrder	2225
self.dict	2226
_iterlists	2227
self.warning	2228
complain	2229
calendar	2230
get_default_timezone	2231
pieces	2232
piece	2233
self.timezone	2234
self.data.hour	2235
hour	2236
tzname	2237
minute	2238
h	2239
60	2240
self.data.month	2241
utcoffset	2242
offset	2243
self.data.day	2244
weekday	2245
self.data.year	2246
U	2247
timetuple	2248
week_number	2249
jan1_weekday	2250
kw	2251
new_datetime	2252
sites	2253
dt	2254
dt.year	2255
site	2256
update_wrapper	2257
__get__	2258
middleware_class	2259
old_method_name	2260
new_method_name	2261
deprecation_warning	2262
renamed_method	2263
old_method	2264
_checkLevel	2265
ConvertingDict	2266
self.configurator.convert	2267
configurator	2268
ConvertingList	2269
ConvertingTuple	2270
result.parent	2271
result.key	2272
config	2273
self.config	2274
incremental	2275
EMPTY_DICT	2276
StandardError	2277
loggers	2278
formatters	2279
existing	2280
propagate	2281
factory	2282
formatter	2283
Promise	2284
memoryview	2285
time_str	2286
language	2287
author_name	2288
categories	2289
ttl	2290
to_unicode	2291
self.feed	2292
add_root_elements	2293
add_item_elements	2294
latest_date	2295
mime_type	2296
handler.startElement	2297
handler.endElement	2298
handler.addQuickElement	2299
cat	2300
unicodedata	2301
to_locale	2302
check_for_language	2303
_format_cache	2304
lang	2305
format_module_path	2306
format_type	2307
decimal_pos	2308
replacement	2309
num_args	2310
resultclasses	2311
__dispatch	2312
self.__args	2313
__args	2314
self.__kw	2315
__kw	2316
cls.__dispatch	2317
resultclass	2318
_delegate_bytes	2319
_delegate_text	2320
__text_cast	2321
__cast	2322
rhs	2323
allow_lazy	2324
new_method_proxy	2325
operator.attrgetter	2326
attrgetter	2327
SimpleLazyObject	2328
fget	2329
fdel	2330
opname	2331
HTMLParser	2332
HTMLParseError	2333
paras	2334
strict	2335
self.fed	2336
word	2337
lead	2338
middle	2339
trail	2340
opening	2341
closing	2342
trimmed	2343
_html_parser	2344
cdata_tag	2345
self.cdata_tag	2346
self.__starttag_text	2347
__starttag_text	2348
endpos	2349
attrvalue	2350
factor	2351
etags	2352
url_info	2353
ip_str	2354
best_doublecolon_start	2355
best_doublecolon_len	2356
doublecolon_start	2357
doublecolon_len	2358
hextets	2359
hextet	2360
new_ip	2361
Tok	2362
regexes	2363
tok	2364
typed	2365
user_function	2366
stats	2367
MISSES	2368
nonlocal_root	2369
PREV	2370
NEXT	2371
oldroot	2372
dotted_path	2373
register_to	2374
module_name	2375
package_path	2376
finder	2377
find_module	2378
file_	2379
use_grouping	2380
str_number	2381
int_part	2382
dec_part	2383
Group	2384
NonCapture	2385
pattern_iter	2386
ch	2387
input_iter	2388
nesting	2389
ch2	2390
result_args	2391
SafeBytes	2392
SafeText	2393
_add_doc	2394
MovedModule	2395
self.mod	2396
_LazyModule	2397
attr.name	2398
_moved_attributes	2399
MovedAttribute	2400
old_attr	2401
new_attr	2402
_MovedItems	2403
Module_six_moves_urllib_request	2404
unbound	2405
unichr	2406
_globs_	2407
_locs_	2408
want_unicode	2409
orig_vars	2410
slots	2411
strnig	2412
self.mutex	2413
mutex	2414
can_write	2415
self.active_readers	2416
active_readers	2417
self.active_writers	2418
active_writers	2419
self.waiting_readers	2420
waiting_readers	2421
self.waiting_writers	2422
waiting_writers	2423
release	2424
color_names	2425
code_list	2426
palette	2427
part	2428
colors	2429
pgettext	2430
add_truncation_text	2431
truncate_len	2432
current_len	2433
open_tags	2434
zfile	2435
multiplication	2436
_time	2437
pytz	2438
ZERO	2439
self.__offset	2440
__offset	2441
self.__name	2442
__name	2443
self._isdst	2444
_isdst	2445
tt	2446
stamp	2447
is_dst	2448
_localtime	2449
_active.value	2450
deactivate	2451
_trans	2452
gettext_noop	2453
ngettext	2454
singular	2455
plural	2456
deactivate_all	2457
lang_code	2458
check_path	2459
get_language_from_path	2460
generic_lang_code	2461
p+1	2462
gettext_module	2463
_supported	2464
CONTEXT_SEPARATOR	2465
get_supported_language_variant	2466
self.__language	2467
__language	2468
localedir	2469
use_null_fallback	2470
_catalog	2471
translation_function	2472
blankout	2473
inplural	2474
lineno_comment_map	2475
comment_lineno_cache	2476
join_tokens	2477
t.token_type	2478
t.contents	2479
filemsg	2480
imatch	2481
priority	2482
children	2483
connector	2484
negated	2485
self.children	2486
self.connector	2487
self.negated	2488
get_git_changeset	2489
