<pad>	0
<unk>	1
<eos>	2
Ooze	3
Minion	4
Card	5
__init__	6
self	7
super	8
 	9
2	10
CHARACTER_CLASS	11
ALL	12
CARD_RARITY	13
COMMON	14
battlecry	15
Battlecry	16
Destroy	17
Weapon	18
Selector	19
Enemy	20
Player	21
create_minion	22
player	23
3	24
Ancestral	25
Healing	26
Spell	27
0	28
SHAMAN	29
FREE	30
target_func	31
hearthbreaker	32
targeting	33
find_minion_spell_target	34
use	35
game	36
target	37
heal	38
effective_heal_power	39
calculate_max_health	40
taunt	41
True	42
HUNTER	43
cards	44
minions	45
hunter	46
Huffer	47
Misha	48
Leokk	49
card	50
random_choice	51
summon	52
len	53
can_use	54
7	55
Arcane	56
MAGE	57
minion	58
copy	59
other_player	60
damage	61
effective_spell_damage	62
1	63
c	64
range	65
draw	66
i	67
targets	68
append	69
hero	70
Shot	71
find_spell_target	72
Reaper	73
5	74
WARRIOR	75
create_weapon	76
ROGUE	77
find_enemy_minion_spell_target	78
die	79
filter_func	80
health	81
spell_targetable	82
Blessing	83
Of	84
Kings	85
of	86
4	87
PALADIN	88
change_attack	89
increase_health	90
Might	91
minion_type	92
MINION_TYPE	93
BEAST	94
change_temp_attack	95
Bluegill	96
Warrior	97
MURLOC	98
charge	99
Boar	100
False	101
Charge	102
find_friendly_minion_spell_target	103
add_buff	104
Buff	105
Yeti	106
Claw	107
DRUID	108
increase_armor	109
remove	110
Core	111
Hound	112
9	113
WARLOCK	114
add_effect	115
Effect	116
Turn	117
Started	118
Action	119
Tag	120
Kill	121
Self	122
Mage	123
spell_damage	124
Divine	125
Spirit	126
PRIEST	127
Dragonling	128
Summon	129
Mechanical	130
Life	131
Dread	132
Infernal	133
6	134
DEMON	135
Damage	136
Character	137
players	138
Both	139
picker	140
User	141
Picker	142
Excess	143
Mana	144
Fireball	145
Totem	146
TOTEM	147
auras	148
Aura	149
Change	150
Attack	151
Adjacent	152
Frog	153
p	154
Frost	155
Nova	156
Frozen	157
Shock	158
Frostwolf	159
Grimscale	160
Oracle	161
Is	162
Type	163
Guardian	164
Heal	165
Hero	166
Berserker	167
effects	168
Damaged	169
condition	170
Target	171
Give	172
Wrath	173
Hand	174
divine_shield	175
Ended	176
None	177
8	178
frog	179
Holy	180
Light	181
NONE	182
Health	183
Taunt	184
calculate_attack	185
Mark	186
set_health_to	187
x	188
Justice	189
Lord	190
The	191
the	192
MECH	193
Mind	194
Blast	195
Control	196
10	197
remove_from_board	198
add_to_board	199
hand	200
Mirror	201
Image	202
Moonfire	203
Murloc	204
Raider	205
Scout	206
Tidehunter	207
Cleric	208
Healed	209
Draw	210
Ogre	211
Leader	212
Hunter	213
character	214
bounce	215
Shadow	216
Bolt	217
Word	218
Death	219
Word:	220
Pain	221
Sheep	222
Shield	223
Block	224
Silver	225
Recruit	226
Placed	227
Stoneclaw	228
Stormwind	229
Champion	230
Wolf	231
deck	232
chosen_card	233
agent	234
choose_option	235
-1	236
trigger	237
card_drawn	238
extend	239
sorted	240
key	241
m	242
born	243
Commander	244
Less	245
Than	246
Or	247
Equal	248
To	249
Elemental	250
Did	251
current_player	252
Knife	253
Wild	254
max_mana	255
Windfury	256
RARE	257
Greater	258
Count	259
DRAGON	260
value	261
overload	262
LEGENDARY	263
deathrattle	264
Deathrattle	265
Bounce	266
Nerubian	267
EPIC	268
Argent	269
Lance	270
Increase	271
Durability	272
buffs	273
Cant	274
Used	275
Power	276
Until	277
Searing	278
Air	279
Call	280
opponent	281
is_minion	282
minion_card	283
Golem	284
Armor	285
Equip	286
Query	287
conditions	288
Died	289
Random	290
Boom	291
Bot	292
Amount	293
Blade	294
reduce_cost	295
Chicken	296
Clockwork	297
Giant	298
12	299
Gnome	300
hearthbreaker.cards.spells.neutral	301
spare_part_list	302
Add	303
source	304
CARD_SOURCE	305
LIST	306
source_list	307
Summoned	308
Cobra	309
Dark	310
t	311
Choice	312
Wisps5	313
Wisp	314
option	315
Doctor	316
Druid	317
Fang	318
Transform	319
Form	320
windfury	321
Not	322
Current	323
And	324
One	325
In	326
Opponent	327
Explosive	328
Fel	329
Cannon	330
Played	331
Discard	332
query	333
MY_DECK	334
Stealth	335
Flame	336
Drawn	337
find_enemy_minion_battlecry_target	338
Attribute	339
attack	340
Force	341
Tank	342
Double	343
Coin	344
Gallywix's	345
mana	346
Cast	347
Cost	348
stealth	349
Goblin	350
Grove	351
choices	352
Crystal	353
Has	354
Secret	355
Imp	356
amount	357
random_amount	358
King	359
lightwarden	360
Lightwarden	361
Remove	362
Bear	363
Cat	364
Leper	365
Machine	366
Battle	367
justice	368
hammer	369
Coldlight	370
Seer	371
Tidecaller	372
Warleader	373
Old	374
Eye	375
Puddlestomper	376
Siltfin	377
Spiritwalker	378
PIRATE	379
Piloted	380
Shredder	381
Name	382
temp_attack	383
check_delayed	384
cards_played	385
weapon	386
Spider	387
Trogg	388
base_attack	389
Burly	390
Rockjaw	391
Unstable	392
Portal	393
new_minon	394
-3	395
Whirling	396
_reveal	397
attacker	398
reveal	399
activate	400
bind	401
minion_died	402
deactivate	403
unbind	404
Baron	405
Duplicate	406
new_card	407
type	408
Feugen	409
Thaddius	410
Graveyard	411
Stalagg	412
Creeper	413
Spectral	414
Resurrect	415
Mad	416
Egg	417
Poison	418
Seeds	419
hearthbreaker.cards.minions.druid	420
Treant	421
Slime	422
_	423
Ghoul	424
Swap	425
With	426
Ancient	427
Brewmaster	428
Watcher	429
War	430
enrage	431
Axe	432
Protector	433
Squire	434
Ashbringer	435
Drake	436
isinstance	437
Rage	438
characters	439
Immune	440
left_minion	441
right_minion	442
index	443
immune	444
Bite	445
draw_player	446
Blood	447
Fury	448
Knight	449
Bloodsail	450
Corsair	451
Bloodhoof	452
Baine	453
Captain	454
Stats	455
Cold	456
is_spell	457
card_played	458
Master	459
Iron	460
Deadly	461
Defias	462
Bandit	463
combo	464
Demonfire	465
Devilsaur	466
Dream	467
DREAM	468
Farseer	469
Emerald	470
Emperor	471
Replace	472
Dragon	473
Finkle	474
Einhorn	475
Nature	476
Lightning	477
Trap	478
character_attack	479
removed	480
Heavy	481
Gnoll	482
Fire	483
Hungry	484
Hyena	485
Ice	486
Azzinoth	487
Inner	488
Silence	489
Panther	490
Dispel	491
Bananas	492
Laughing	493
Sister	494
Lava	495
Whelp	496
Jaraxxus	497
15	498
Bomber	499
silence	500
Steal	501
random_draw	502
drawn	503
Nothing	504
mirror	505
minion_played	506
Mortal	507
Strike	508
Nightmare	509
Assassin	510
Priestess	511
Worgen	512
Ragnaros	513
Scarlet	514
demon_card	515
Worthless	516
power	517
powers	518
Spike	519
Slam	520
Snake	521
Apprentice	522
Soul	523
Southsea	524
Spellbender	525
Squirrel	526
Black	527
Twilight	528
Violet	529
wrath	530
Young	531
Ysera	532
Awakens	533
Blackwing	534
Technician	535
Rager	536
Dead	537
Bird	538
Gang	539
Grim	540
Patron	541
Volcanic	542
Gnomish	543
Burrowing	544
Mine	545
Archmage	546
Defender	547
Earth	548
sheep	549
attack_power	550
enemies	551
fatigue	552
possibilities	553
current_target	554
resurrection	555
