{"<pad>": 0, "<unk>": 1, "<eos>": 2, "NAME_BEGIN": 3, "NAME_END": 4, "ATK_BEGIN": 5, "3": 6, "ATK_END": 7, "DEF_BEGIN": 8, "2": 9, "DEF_END": 10, "COST_BEGIN": 11, "COST_END": 12, "DUR_BEGIN": 13, "-1": 14, "DUR_END": 15, "TYPE_BEGIN": 16, "Minion": 17, "TYPE_END": 18, "PLAYER_CLS_BEGIN": 19, "Neutral": 20, "PLAYER_CLS_END": 21, "RACE_BEGIN": 22, "NIL": 23, "RACE_END": 24, "RARITY_BEGIN": 25, "Common": 26, "RARITY_END": 27, "DESC_BEGIN": 28, "Battlecry": 29, ":": 30, "Destroy": 31, "your": 32, "opponent": 33, "'s": 34, "weapon": 35, ".": 36, "DESC_END": 37, "Ancestral": 38, "Healing": 39, "0": 40, "Spell": 41, "Shaman": 42, "Free": 43, "Restore": 44, "a": 45, "minion": 46, "to": 47, "full": 48, "Health": 49, "and": 50, "give": 51, "it": 52, "Taunt": 53, "Hunter": 54, "Summon": 55, "random": 56, "Beast": 57, "Arcane": 58, "Mage": 59, "Deal": 60, "$": 61, "1": 62, "damage": 63, "all": 64, "enemy": 65, "minions": 66, "Draw": 67, "cards": 68, "randomly": 69, "split": 70, "among": 71, "enemies": 72, "Shot": 73, "5": 74, "Weapon": 75, "Warrior": 76, "Rogue": 77, "an": 78, "Blessing": 79, "of": 80, "4": 81, "Paladin": 82, "Give": 83, "(": 84, "+4": 85, ")": 86, "+3": 87, "Attack": 88, "this": 89, "turn": 90, "Murloc": 91, "Charge": 92, "Boar": 93, "friendly": 94, "+2": 95, "Claw": 96, "Druid": 97, "hero": 98, "Armor": 99, "two": 100, "Hound": 101, "9": 102, "7": 103, "Warlock": 104, "Choose": 105, "At": 106, "the": 107, "start": 108, ",": 109, "destroy": 110, "Damage": 111, "+1": 112, "Divine": 113, "Spirit": 114, "Priest": 115, "Double": 116, "Dragonling": 117, "2/1": 118, "Mechanical": 119, "#": 120, "6": 121, "Demon": 122, "ALL": 123, "other": 124, "characters": 125, "Mana": 126, "card": 127, "You": 128, "only": 129, "have": 130, "10": 131, "in": 132, "damaged": 133, "Totem": 134, "Adjacent": 135, "Frost": 136, "Freeze": 137, "Shock": 138, "character": 139, "Murlocs": 140, "Guardian": 141, "Berserker": 142, "Whenever": 143, "takes": 144, "gain": 145, "Wrath": 146, "NL": 147, "Hand": 148, "Shield": 149, "end": 150, "restore": 151, "8": 152, "Transform": 153, "into": 154, "with": 155, "Holy": 156, "Light": 157, "+2/+2": 158, "Change": 159, "Mark": 160, "If": 161, "you": 162, "deal": 163, "instead": 164, "Your": 165, "Lord": 166, "Mech": 167, "Mind": 168, "Take": 169, "control": 170, "Put": 171, "copy": 172, "hand": 173, "Mirror": 174, "1/1": 175, "is": 176, "healed": 177, "draw": 178, "Ogre": 179, "Return": 180, "Shadow": 181, "Word": 182, "Death": 183, "or": 184, "more": 185, "Pain": 186, "less": 187, "+1/+1": 188, "Sheep": 189, "Gain": 190, "Silver": 191, "Discard": 192, "summon": 193, "Champion": 194, "Wolf": 195, "Beasts": 196, "at": 197, "three": 198, "deck": 199, "one": 200, "attacks": 201, "their": 202, "owner": 203, "Elemental": 204, "any": 205, "by": 206, "Wild": 207, "empty": 208, "Crystal": 209, "Windfury": 210, "Rare": 211, "'re": 212, "holding": 213, "Dragon": 214, "Overload": 215, "Legendary": 216, "Deathrattle": 217, "Nerubian": 218, "Epic": 219, "This": 220, "spell": 221, "from": 222, "Argent": 223, "each": 224, "costs": 225, "Durability": 226, "Ca": 227, "n't": 228, "attack": 229, "as": 230, "player": 231, "battlefield": 232, "Golem": 233, "be": 234, "targeted": 235, "spells": 236, "Hero": 237, "Powers": 238, "Equip": 239, "for": 240, "dies": 241, "while": 242, "Boom": 243, "Blade": 244, "until": 245, "Chicken": 246, "Giant": 247, "12": 248, "Costs": 249, "Gnome": 250, "Add": 251, "Spare": 252, "Part": 253, "Has": 254, "Dark": 255, "One": 256, "-": 257, ";": 258, "+5/+5": 259, "50": 260, "%": 261, "chance": 262, "wrong": 263, "Explosive": 264, "on": 265, "plays": 266, "Stealth": 267, "next": 268, "Flame": 269, "When": 270, "its": 271, "Gallywix": 272, "cast": 273, "add": 274, "Goblin": 275, "has": 276, "draws": 277, "play": 278, "Secret": 279, "Imp": 280, "that": 281, "King": 282, "target": 283, "equal": 284, "'": 285, "Shuffle": 286, "Mechs": 287, "cost": 288, "them": 289, "All": 290, "Battle": 291, "Pirate": 292, "Swap": 293, "Combo": 294, "Power": 295, "Trogg": 296, "casts": 297, "put": 298, "Feugen": 299, "Stalagg": 300, "died": 301, "game": 302, "Thaddius": 303, "Spectral": 304, "2/2": 305, "Treants": 306, "return": 307, "Treant": 308, "Ancient": 309, "adjacent": 310, "War": 311, "+5": 312, "Enrage": 313, "Protector": 314, "Squire": 315, "Drake": 316, "Axe": 317, "Immune": 318, "Blood": 319, "another": 320, "Knight": 321, "+3/+3": 322, "Bloodhoof": 323, "Master": 324, "Iron": 325, "Defias": 326, "Dream": 327, "Crystals": 328, "Lightning": 329, "Trap": 330, "Fire": 331, "Ice": 332, "attacked": 333, "Silence": 334, "Panther": 335, "Jaraxxus": 336, "15": 337, "take": 338, "Strike": 339, "Assassin": 340, "The": 341, "Demons": 342, "Apprentice": 343, "Soul": 344, "Violet": 345, "Whelp": 346, "After": 347, "!": 348, "Ysera": 349, "Defender": 350}